#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	//ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	//ПараметрыРегистрации.Вид 			= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Наименование 	= "Загрузка чеков из файла выписки JSON";
	//ПараметрыРегистрации.Информация 	= "Загрузка чеков из файла выписки JSON";
	//ПараметрыРегистрации.Версия 		= "1.0";
	//ПараметрыРегистрации.БезопасныйРежим = Ложь;
	//
	//НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	//НоваяКоманда.Представление = НСтр("ru = 'Загрузка чеков из файла выписки JSON'");
	//НоваяКоманда.Идентификатор = "ЗагрузкаЧековИзФайлаВыпискиJSON";
	//НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	//НоваяКоманда.ПоказыватьОповещение = Истина;
	//
	//Возврат ПараметрыРегистрации;
	  		
КонецФункции

#КонецОбласти

#КонецЕсли