#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	Если  Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки")
		И Не ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ДополнительныеОтчетыИОбработки") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МодульДополнительныеОтчетыИОбработки = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
	МодульДополнительныеОтчетыИОбработкиКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработкиКлиентСервер");
	
	ПараметрыРегистрации = МодульДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.2.157");
	ПараметрыРегистрации.Вид 			= МодульДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименование 	= "Загрузка чеков из файла выписки JSON";
	ПараметрыРегистрации.Информация 	= "Обработка для загрузки чеков в 1С:Деньги 8 из файла выписки JSON, формируемого официальным мобильным приложением ФНС ""Проверка чеков"".";
	ПараметрыРегистрации.Версия 		= "1.2";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Загрузка чеков из файла выписки JSON'");
	НоваяКоманда.Идентификатор = "ЗагрузкаЧековИзФайлаВыпискиJSON";
	НоваяКоманда.Использование = МодульДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат ПараметрыРегистрации;
	  		
КонецФункции

#КонецОбласти

#КонецЕсли